IdeaRS.OpenModel.Connection.IdeaConImportSettings.DesignCode
Gets or sets the Design Code
There can be :
ECEN
AISC
CISC

IdeaRS.OpenModel.Connection.IdeaConImportSettings.StartIdeaStaticaApp
StartIdeaStaticaApp